Конфигурация/Reports/КонтрольАкцептованияОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>КонтрольАкцептованияОпераций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьАкцептованныеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/Reports/КонтрольАкцептованияОпераций/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
		Для Каждого ТекВидДУ Из Отчет.ВидыДоговоровДоверительногоУправления Цикл
			ЭтотОбъект.СДУИВидыДДУ.Добавить(ТекВидДУ.Значение);
		КонецЦикла;
		
		Для Каждого ТекСчетДУ Из Отчет.СчетаДоверительногоУправления Цикл
			ЭтотОбъект.СДУИВидыДДУ.Добавить(ТекСчетДУ.Значение);
		КонецЦикла;
		
	Иначе
		Отчет.Период.ДатаНачала	= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ТекущаяДата()), -2);
		Отчет.Период.ДатаОкончания = Отчет.Период.ДатаНачала;
		Отчет.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
		Отчет.ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда);
		Отчет.ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
		Отчет.ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
		Отчет.ВидыДоговоровДоверительногоУправления.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР);
		
		ЭтотОбъект.СДУИВидыДДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда);
		ЭтотОбъект.СДУИВидыДДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
		ЭтотОбъект.СДУИВидыДДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
		ЭтотОбъект.СДУИВидыДДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеВСписок(Список, Значение)
	
	НовыйЭлемент = Список.Добавить(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СДУИВидыДДУПриИзменении(Элемент)
	
	Отчет.СчетаДоверительногоУправления.Очистить();
	Отчет.ВидыДоговоровДоверительногоУправления.Очистить();
	
	Для Каждого ТекЭлемент Из СДУИВидыДДУ Цикл
		
		Если ЗначениеЗаполнено(ТекЭлемент.Значение) Тогда
			Если ТипЗнч(ТекЭлемент.Значение) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
				ДобавитьЗначениеВСписок(Отчет.СчетаДоверительногоУправления, ТекЭлемент.Значение);
			ИначеЕсли ТипЗнч(ТекЭлемент.Значение) = Тип("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления") Тогда
				ДобавитьЗначениеВСписок(Отчет.ВидыДоговоровДоверительногоУправления, ТекЭлемент.Значение);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
